app/controllers/requests_controller.rb

  def index
    @requests = Request.all
---
SELECT * FROM "requests"

  def show
    @request = Request.find(params[:id])
---
SELECT * FROM "requests" WHERE ("requests"."id" = 1)

  def create
    @request = Request.new(params[:request])
    if params[:latitude]  then @request[:latitude]  = params[:latitude]  end
    if params[:longitude] then @request[:longitude] = params[:longitude] end

    success = @request.save
---
INSERT INTO "requests" ("latitude", "created_at", "updated_at", "map_content_type", "map_data", "longitude") VALUES(51.27, '2010-02-21 11:52:58', '2010-02-21 11:52:58', 'image/png', '‰PNG